;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

(package! modus-themes)
(package! telephone-line)
(package! solaire-mode :disable t)
(package! webfeeder)
(package! org-bullets)
(package! direnv)
(package! swiper)
(unpin! org-roam)
(package! org-roam-ui)
(package! tree-sitter)
(package! tree-sitter-langs)
(unpin! tree-sitter)
(unpin! tree-sitter-langs)
